Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_1.tmx
Source language: de
Languages: en

source: Siliziumkarbid [Schleifmittel]
en: Silicon carbide [abrasive]

source: Peelings für die Hautpflege
en: Exfoliants for the care of the skin

source: Aftershave-Cremes
en: Aftershave creams

source: Duftöle zur Erzeugung von Aromen durch Erhitzen
en: Scented oils used to produce aromas when heated

source: Öle für kosmetische Zwecke
en: Oils for cosmetic purposes

source: Mit Reinigungsmitteln imprägnierte Wischtücher
en: Wipes incorporating cleaning preparations

source: Nagelhärter [Kosmetika]
en: Nail hardeners [cosmetics]

source: Nagelspitzen [Kosmetika]
en: Nail tips [cosmetics]

source: Lösungsmittel zum Entfernen von Lacken
en: Solvents for removing varnishes

source: Shampoos für Haustiere [nicht medizinische Pflegemittel]
en: Shampoos for pets [non-medicated grooming preparations]

source: Kosmetische Bräunungslotionen
en: Suntan lotion [cosmetics]

source: Talkumpuder für Babys, nicht für medizinische Zwecke
en: Talcum powder (Non-medicated -) for babies

source: Entfernbare Tattoos für kosmetische Zwecke
en: Temporary tattoo's for cosmetic purposes

source: Präparate zum Konditionieren von Gewebe
en: Fabric conditioning preparations

source: Duftstoffe für die Wäsche
en: Sachets for perfuming linen

source: Sonnenöle für kosmetische Zwecke
en: Suntan oils for cosmetic purposes

source: Lotionen zur Cellulitereduzierung
en: Lotions for cellulite reduction

source: Pfefferminzessenz [ätherisches Öl]
en: Mint essence [essential oil]

source: Klebstoffe für kosmetische Zwecke
en: Adhesives for cosmetic purposes

source: Kosmetische Feuchtigkeitskonzentrate
en: Moisturising concentrates [cosmetic]

source: Waschmittel für Haushaltsreinigungszwecke
en: Laundry detergents for household cleaning use

source: Reinigungspasten für Schuhe
en: Pastes for cleaning shoes

source: Parfümierte Lotionen [Toilettenpräparate]
en: Perfumed lotions [toilet preparations]

source: Fette für kosmetische Zwecke
en: Greases for cosmetic purposes

source: Wasserstoffsuperoxid für kosmetische Zwecke
en: Hydrogen peroxide for cosmetic purposes

source: Nagellack
en: Nail varnish

source: Entfettungspräparate für Motoren
en: Degreasing preparations for engines

source: Deodorants für den persönlichen Gebrauch in Form von Sticks
en: Deodorants, for personal use in the form of sticks

source: Imprägnierte Tücher für Kosmetikzwecke
en: Impregnated cloths for cosmetic use

source: Nährcremes, nicht für medizinische Zwecke
en: Nutritional creams (Non-medicated -)

source: Kosmetische Schlankheitspräparate
en: Cosmetic preparations for slimming purposes

source: Mit Seifen imprägnierte Schwämme
en: Sponges impregnated with soaps

source: Fleckentfernungspräparate zur Verwendung auf Haushaltswaren
en: Stain removing preparations for use on household goods

source: Kosmetische Hautpflegecremes
en: Skin care creams [cosmetic]

source: Raumparfüms in Sprayform
en: Room perfumes in spray form

source: Badeöle für die Haarpflege
en: Oil baths for hair care

source: Parfümierte Cremes
en: Perfumed creams

source: Duftende Tannenzapfen
en: Scented pine cones

source: Ätherische Öle von Zedernholz
en: Essential oils of cedarwood

source: Reinigungsmittel für den persönlichen Gebrauch
en: Cleaning preparations for personal use

source: Mit Reinigungsmitteln getränkte Pads
en: Cleaning preparations impregnated into pads

source: Färbepräparate für kosmetische Zwecke
en: Colouring preparations for cosmetic purposes

source: Ätherische Öle zur Verwendung in Luftauffrischern
en: Essential oils for use in air fresheners

source: Künstliche Wimpern
en: False eyelashes

source: Emulgierte ätherische Öle
en: Emulsified essential oils

source: Potpourris [Duftstoffe]
en: Potpourris [fragrances]

source: Ambra [Parfüm]
en: Amber [perfume]

source: Fensterreinigungsmittel in Sprayform
en: Window cleaners in spray form

source: Hautpflegepräparate zur Faltenreduzierung
en: Wrinkle removing skin care preparations

source: Nicht medizinisches Badesalz
en: Non-medicated bath salts

source: Lebensmittelaromen [ätherische Öle]
en: Food flavourings [essential oils]

source: Kosmetika
en: Cosmetics

source: Öle für Reinigungszwecke
en: Oils for cleaning purposes

source: Nagellack für kosmetische Zwecke
en: Nail varnish for cosmetic purposes

source: Reinigungsmilch für die Hautpflege
en: Cleansing milks for skin care

source: Farbkosmetika für die Augen
en: Colour cosmetics for the eyes

source: Feuchtigkeitsmittel [Kosmetika] für den Körper
en: Degreasers, other than for use in manufacturing processes

source: Waschmittel für Haushaltszwecke
en: Vehicle cleaning preparations

source: Mittel zur Entfernung der Bodenversiegelung
en: Washing preparations for household purposes

source: Flüssige Schaumbäder
en: Floor finish removers

source: Schäume als Haarstylinghilfen
en: Smoothing preparations [starching]

source: Stärke [Appreturmittel]
en: Starch for laundry purposes

source: Mittel zur Intimreinigung für hygienische oder desodorierende Zwecke [Toiletteartikel]
en: Douching preparations for personal sanitary or deodorant purposes [toiletries]

source: Aloe Vera-Mittel für kosmetische Zwecke
en: Aloe vera preparations for cosmetic purposes

source: Nicht medizinische Shampoos
en: Non-medicated shampoos

source: Kosmetische Sonnenschutzlippenstifte
en: Sun blocking lipsticks [cosmetics]

source: Vulkanasche [Putzmittel]
en: Volcanic ash for cleaning

source: Glitzer für kosmetische Zwecke
en: Glitter for cosmetic purposes

source: Peelings für die Hautreinigung
en: Exfoliants for the cleansing of the skin

source: Kosmetische Kompaktpuderdosen
en: Powder compacts [cosmetics]

source: Reinigungsmittel für Zahnprothesen
en: Preparations for cleaning dentures

source: Fensterreiniger [Poliermittel]
en: Window cleaners [polish]

source: Onduliermittel für Haare
en: Hair waving preparations

source: Glitzerstaub in Sprayform für kosmetische Zwecke
en: Glitter in spray form for use as a cosmetics

source: Rasiersteine [Präparate]
en: Shaving sticks [preparations]

source: Schuhreinigungsmittel [Präparate]
en: Shoe cleaners [preparations]

source: Deodorantsprays für Damen
en: Feminine deodorant sprays

source: Ionon [Duftstoff]
en: Ionone [perfumery]

source: Mit Duftsubstanzen getränkte Kissen
en: Cushions impregnated with fragrant substances

source: Mit parfümierten Substanzen getränkte Kissen
en: Cushions impregnated with perfumed substances

source: Detergenzien, ausgenommen zur Verwendung in Herstellungsverfahren und für medizinische Zwecke
en: Detergents, other than for use in manufacturing operations and for medical purposes

source: Alkoholische Lösungsmittel als Reinigungsmittel
en: Alcoholic solvents being cleaning preparations

source: Kosmetische Tonisierungscremes
en: Toning creams [cosmetic]

source: Schäumende Badegele
en: Foaming bath gels

source: Kosmetische Feuchtigkeitsgele
en: Moisturising gels [cosmetic]

source: Kosmetische Hautfeuchtigkeitscremes
en: Moisturising skin creams [cosmetic]

source: Bleichcreme für die Haut
en: Skin whitening creams

source: Massagegele, ausgenommen für medizinische Zwecke
en: Massage gels, other than for medical purposes

source: Schleifpapier zur Verwendung für die Fingernägel
en: Abrasive paper for use on the fingernails

source: Kosmetische Präparate zur Unterstützung beim Abnehmen
en: Cosmetic preparations for use as aids to slimming

source: Körperpuder
en: Body powder

source: Terpentin zum Entfetten
en: Turpentine for degreasing

source: Spülmittel zur Verwendung beim Wäschewaschen
en: Rinsing aids for use when washing clothes

source: Lebensmittelaromen bestehend aus ätherischen Ölen
en: Food flavorings prepared from essential oils

source: Reinigungsmittel für Mauerwerk
en: Cleaning preparations for use on masonry

source: Kosmetische Augengele
en: Cosmetic eye gels

source: Essenzen für die Hautpflege
en: Essences for skin care

source: Poliermittel für Musikinstrumente
en: Polish for musical instruments

source: Feuchte Kosmetiktücher
en: Pre-moistened cosmetic wipes

source: Mit einem Reinigungsmittel für Brillen imprägnierte Wischtücher
en: Wiping cloth impregnated with a cleaning preparation for cleaning eye glasses

source: Puderdosen mit Make-up
en: Compacts containing make-up

source: Seifen gegen Fußschweiß
en: Soap for foot perspiration

source: Pomaden für kosmetische Zwecke
en: Pomades for cosmetic purposes

source: Natürliche Öle für Parfums
en: Natural oils for perfumes

source: Haarspray
en: Hair spray

source: Badezusätze, nicht für medizinische Zwecke
en: Bath preparations, not for medical purposes

source: Schweißhemmende Seifen
en: Antiperspirant soap

source: Aus Potpourris in Stoffbehältern bestehende Aromatherapiekissen
en: Aromatherapy pillows comprising potpourri in fabric containers

source: Rasiermittel in flüssiger Form
en: Shaving preparations in liquid form

source: Lotionen für kosmetische Zwecke
en: Lotions for cosmetic purposes

source: Feste Parfüms
en: Solid perfumes

source: Mit Duftsubstanzen gefüllte Kissen
en: Cushions filled with fragrant substances

source: Waschmittel für Textilien
en: Washing agents for textiles

source: Pflegemittel für die Wäsche
en: Washing conservation agents

source: Mineralwasser-Sprays für kosmetische Zwecke
en: Mineral water sprays for cosmetic purposes

source: Parfümierte Körperlotionen [Toilettepräparate]
en: Perfumed body lotions [toilet preparations]

source: Parfümierte Tücher
en: Perfumed tissues

source: Lösungsmittel für Fußbodenwachs [Reinigungsmittel]
en: Floor wax removers [scouring preparations]

source: Natürliche Stärken für Wäschereizwecke
en: Natural starches for laundry purposes

source: Klebstoffe für künstliche Wimpern
en: Adhesives for affixing false eyelashes

source: Salben für kosmetische Zwecke
en: Ointments for cosmetic use

source: Mit Reinigungsmitteln imprägnierte Papierhandtücher
en: Paper hand towels impregnated with cleaning agents

source: Wattestäbchen für kosmetische Zwecke
en: Cotton swabs for cosmetic purposes

source: Watte für kosmetische Zwecke
en: Cotton wool for cosmetic purposes

source: Aromastoffe für Duftstoffe
en: Aromatics for fragrances

source: Schutzcremes für die Haare
en: Hair protection creams

source: Hautpflegelotionen [Kosmetika]
en: Skin care lotions [cosmetic]

source: Künstliche Fingernägel aus Edelmetall
en: Artificial fingernails of precious metal

source: Ätherische Öle für die Hautpflege
en: Essential oils for the care of the skin

source: Aftershave-Milch
en: Aftershave milk

source: Mittel zum Abspülen
en: Washing-up detergent

source: Duftwasser
en: Scented water

source: Seifen für Haushaltszwecke
en: Soaps for household use

source: Waschpulver
en: Soap powder

source: Reinigungs- und Duftpräparate
en: Cleaning and fragrancing preparations

source: Ätherische Öle und aromatische Extrakte
en: Essential oils and aromatic extracts

source: Parfümeriewaren und Duftstoffe
en: Perfumery and fragrances

source: Körperreinigungs- und Körperpflegepräparate
en: Body cleaning and beauty care preparations

source: Schneider- und Schusterwachs
en: Tailors' and cobblers' wax

source: Präparate für die Mundhygiene
en: Oral hygiene preparations

source: Leder- und Schuhreinigungs- und poliermittel
en: Leather and shoe cleaning and polishing preparations

source: Deodorants und Antitranspirantien
en: Deodorants and antiperspirants

source: Seifen und Gele
en: Soaps and gels

source: Enthaarungs- und Rasiermittel
en: Hair removal and shaving preparations

source: Anti-Schuppenshampoos, nicht für medizinische Zwecke
en: Dandruff shampoos, not for medical purposes

source: Seren für kosmetische Zwecke
en: Serums for cosmetic purposes

source: Phytokosmetische Mittel
en: Phytocosmetic preparations

source: Nicht medizinische Reinigungsmittel zur Intimpflege
en: Cleansers for intimate personal hygiene purposes, non medicated

source: Kräuterextrakte für kosmetische Zwecke
en: Herbal extracts for cosmetic purposes

source: Shampoos für Tiere [nicht medizinische Pflegemittel]
en: Shampoos for animals [non-medicated grooming preparations]

source: Augenbäder, nicht für medizinische Zwecke
en: Eye-washes, not for medical purposes

source: Vaginalspülungen zur Intimreinigung oder für desodorierende Zwecke
en: Vaginal washes for personal sanitary or deodorant purposes

source: Sunblocker in Sprayform
en: SPF sun block sprays

source: Klebemittel für künstliche Wimpern, Haarteile und Nägel
en: Adhesives for false eyelashes, hair and nails

source: Aftershave-Emulsionen
en: After-shave emulsions

source: Aloe Vera-Gele für kosmetische Zwecke
en: Aloe vera gel for cosmetic purposes

source: Ammoniak für Reinigungszwecke
en: Ammonia for cleaning purposes

source: Badeöle für kosmetische Zwecke
en: Bath oils for cosmetic purposes

source: Karnaubawachs zum Polieren von Autos
en: Carnauba wax for automotive use

source: Kosmetische Mittel gegen das Nachwachsen von Haaren
en: Cosmetic hair regrowth inhibiting preparations

source: Kosmetische Handcremes
en: Cosmetic hand creams

source: Kosmetische Nährcremes
en: Cosmetic nourishing creams

source: Kosmetische Öle für die Haut
en: Cosmetic oils for the epidermis

source: Kosmetische Präparate für die Körperpflege
en: Cosmetic preparations for body care

source: Kosmetische Präparate zum Trocknen der Nägel
en: Cosmetic preparations for nail drying

source: Kosmetische Präparate zur Mund- und Zahnpflege
en: Cosmetic preparations for the care of mouth and teeth

source: Kosmetische Präparate für Haar und Kopfhaut
en: Cosmetic preparations for the hair and scalp

source: Kosmetische Produkte in Form von Aerosolen für die Hautpflege
en: Cosmetic products in the form of aerosols for skincare

source: Kosmetika und kosmetische Präparate
en: Cosmetics and cosmetic preparations

source: Fettentfernungsmittel für Haushaltszwecke
en: De-greasing preparations for household purposes

source: Zahnputzmittel in Form von Kaugummi
en: Dentifrices in the form of chewing gum

source: Detergenzien aus Petroleum
en: Detergents prepared from petroleum

source: Ätherische Öle als Duftstoffe für Waschzwecke
en: Essential oils as perfume for laundry purposes

source: Ätherische Öle für die Aromatherapie
en: Essential oils for aromatherapy use

source: Pflanzliche ätherische Öle
en: Essential vegetable oils

source: Gesichtspuder auf Papier
en: Face-powder on paper

source: Granulierte Seifen
en: Granulated soaps

source: Flüssige Badeseifen
en: Liquid bath soaps

source: Flüssige Parfums
en: Liquid perfumes

source: Flüssigseife für Fußbäder
en: Liquid soap used in foot bath

source: Flüssige Seifen für Hände und Gesicht
en: Liquid soaps for hands and face

source: Schminke für Gesicht und Körper
en: Make-up for the face and body

source: Parfümöle zur Herstellung von kosmetischen Präparaten
en: Perfume oils for the manufacture of cosmetic preparations

source: Feuchte Tüchlein getränkt mit Geschirrspülmittel
en: Pre-moistened towelettes impregnated with dishwashing detergent

source: Retinolcreme für kosmetische Zwecke
en: Retinol cream for cosmetic purposes

source: Meeresalgen-Gelatine für Waschzwecke [Funori]
en: Seaweed gelatine for laundry use (funori)

source: Dusch- und Badegel
en: Shower and bath gel

source: Hautpflegecremes für kosmetische Zwecke
en: Skin conditioning creams for cosmetic purposes

source: Bleichcremes für die Haut
en: Skin lightening creams

source: Reinigungssprays zur Auffrischung von Sportlermundschutz
en: Spray cleaners for freshening athletic mouth guards

source: Benzin zur Fleckentfernung
en: Stain removing benzine

source: Bräunungsmilch [Kosmetika]
en: Tanning milks [cosmetics]

source: Mit Zahnbleichpräparaten getränkte Zahnaufhellungsstreifen [Kosmetika]
en: Teeth whitening strips impregnated with teeth whitening preparations [cosmetics]

source: Tonisierende Lotion für Gesicht, Körper und Hände
en: Toning lotion, for the face, body and hands

source: Kosmetische Gesichtspeelings
en: Facial scrubs [cosmetic]

source: Parfümierter Puder für kosmetische Zwecke
en: Perfumed powder [for cosmetic use]

source: Gesichtswässer [Kosmetika]
en: Cosmetic facial lotions

source: Lederkonservierungsmittel [Wichse]
en: Leather preservatives [polishes]

source: Talkumpuder für Toilettezwecke
en: Talcum powder, for toilet use

source: Kosmetische Sonnenschutzmittel
en: Cosmetic sun-protecting preparations

source: Weichspülmittel für Wäsche
en: Fabric softeners for laundry use

source: Ätherische Zitronenöle
en: Essential oils of lemon

source: Schaumbäder
en: Bubble bath

source: Duftstoffe
en: Fragrances

source: Parfüms
en: Perfumes

source: Befeuchtete Zahnpulver
en: Moistened tooth powder

source: Sandpapier
en: Sandpaper

source: Schleifpapier
en: Abrasive paper

source: Aftershave-Gele
en: After-shave gel

source: Mittel zum Färben der Haare
en: Hair dyeing preparations

source: Waschmittel für Kraftfahrzeuge
en: Detergents for automobiles

source: Gesichtsmasken
en: Facial masks

source: Aftershave-Balsam
en: Aftershave balms

source: Kölnischwasser
en: Eau de Cologne

source: Toilettenseifen
en: Cakes of toilet soap

source: Bohnerwachs
en: Floor wax

source: Ätherische Öle zur Nervenberuhigung
en: Essential oils for soothing the nerves

source: After-Sun-Öle [Kosmetika]
en: After-sun oils [cosmetics]

source: Reinigungsmittel
en: Cleaning preparations

source: Spülmittel für Geschirrspülmaschinen
en: Detergents for machine dishwashing

source: Schuhschwärze [Schuhpolitur]
en: Shoe black [shoe polish]

source: Schminkmittel für Gesicht und Körper
en: Make-up preparations for the face and body

source: Reiniger für Haushaltszwecke
en: Cleansers for household purposes

source: Cremiger Gesichtspuder
en: Creamy face powder

source: Dusch- und Badeschaum
en: Shower and bath foam

source: Bleichmittel für Haushaltszwecke
en: Bleaching preparations for household use

source: Hygienepräparate als Körperpflegemittel
en: Sanitary preparations being toiletries

source: Bräunungscremes und -lotionen
en: Sun-tanning creams and lotions

source: Kosmetische Cremes zum Straffen der Augenpartie
en: Cosmetic creams for firming skin around eyes

source: Ätherische Essenzen und Öle
en: Ethereal essences and oils

source: Reinigungsmittel für Textilien
en: Cleaning preparations for fabrics

source: Reinigungsmittel für Leder
en: Cleaning preparations for leather

source: Stückseifen zur Körperreinigung
en: Cakes of soap for body washing

source: Künstliche Bimssteine
en: Artificial pumice stone

source: Stylingpaste für das Haar
en: Styling paste for hair

source: Mittel zur Nagelreparatur
en: Nail repair preparations

source: Feuchtigkeitscremes, -lotionen und -gele
en: Moisturising creams, lotions and gels

source: Flüssiges Rouge
en: Liquid rouge

source: Nichtmedizinische Massagemittel
en: Non-medicated massage preparations

source: Kosmetische Nagelpflegemittel
en: Cosmetic nail care preparations

source: Kosmetische Cremes und Lotionen
en: Cosmetic creams and lotions

source: Bade- und Duschgele, nicht für medizinische Zwecke
en: Bath and shower gels, not for medical purposes

source: Haarpflegemittel, nicht für medizinische Zwecke
en: Hair care preparations, not for medical purposes

source: Concealer für Pickel und Hautunreinheiten
en: Concealers for spots and blemishes

source: Nichtmedizinische Präparate zur Linderung von Sonnenbrand
en: Non-medicated preparations for the relief of sunburn

source: Tücher getränkt mit ätherischen Ölen für kosmetische Zwecke
en: Tissues impregnated with essential oils, for cosmetic use

source: Kosmetische Haarlotionen
en: Cosmetic hair lotions

source: Dauerwellen- und Lockenpräparate
en: Permanent waving and curling preparations

source: Kosmetische mattierende Pasten zum Auftragen auf das Gesicht
en: Cosmetic paste for application to the face to counteract glare

source: Kosmetische Präparate zur Faltenreduktion zum Auftragen im Gesicht
en: Wrinkle-minimizing cosmetic preparations for topical facial use

source: Parfümierte Körperlotionen und -cremes
en: Scented body lotions and creams

source: Nichtmedizinische Fußbäder
en: Non-medicated foot soaks

source: Nichtmedizinische Fußlotionen
en: Non-medicated foot lotions

source: Einwegtücher getränkt mit Reinigungspräparaten zur Anwendung im Gesicht
en: Disposable wipes impregnated with cleansing compounds for use on the face

source: Natürliche ätherische Öle
en: Natural essential oils

source: Ätherische Öle für Haushaltszwecke
en: Essential oils for household use

source: Duftstoff-Nachfüllungen für nicht-elektrische Raumduftspender
en: Fragrance refills for non-electric room fragrance dispensers

source: Reinigungsmittel für Pflanzenblätter
en: Cleaning preparations for plant leaves

source: Desodorierte Reinigungsmittel für Katzentoiletten
en: Litter tray cleaners incorporating a deodorizer

source: Sandpapierblöcke zum Spitzen von Zeichenstiften
en: Sandpaper pads for sharpening drawing pencils

source: Sandpapier zum Spitzen von Zeichenstiften
en: Sandpaper for sharpening drawing pencils

source: Lavendelöl für kosmetische Zwecke
en: Lavender oil for cosmetic use

source: Nichtmedizinische Hautseren
en: Non-medicated skin serums

source: Applikatoren für Schuhpolitur mit Inhalt
en: Shoe polish applicators containing shoe polish

source: Getränkte Papiertücher für die Reinigung von Geschirr
en: Impregnated paper tissues for cleaning dishware

source: Reinigungstüchlein für die weibliche Hygiene
en: Feminine hygiene cleansing towelettes

source: Duftbeutel für Augenkissen
en: Fragrance sachets for eye pillows

source: Nichtmedizinische anregende Lotionen für die Haut
en: Non-medicated stimulating lotions for the skin

source: Nichtmedizinische Badezusätze
en: Non-medicated body soaks

source: Wasserstoffperoxid für das Haar
en: Hydrogen peroxide for use on the hair

source: Haftkleber für Haarteile
en: Hair piece bonding glue

source: Augenkompressen für kosmetische Zwecke
en: Eye compresses for cosmetic purposes

source: Ätherische Öle zur Verwendung bei der Herstellung parfümierter Produkte
en: Essential oils for use in the manufacture of scented products

source: Ätherische Öle zur Verwendung in Herstellungsverfahren
en: Essential oils for use in manufacturing processes

source: Ätherische Öle für industrielle Zwecke
en: Essential oils for industrial use

source: Reinigungsmittel für Abflussrohre
en: Drain cleaning preparations

source: Nichtmedizinische Deodorants
en: Non-medicated antiperspirants

source: Kosmetische Mittel für die Hauterneuerung
en: Cosmetic preparations for skin renewal

source: Make-Up für Puderdosen
en: Make-up for compacts

source: Reinigungslösungen für Ultraschall-Sterilisationsgeräte im Dentalbereich
en: Cleaning solutions for dental ultrasonic sterilization apparatus

source: Putz- und Glanzmittel für Pflanzenblätter
en: Cleaning and shining preparations for plant leaves

source: Atemerfrischer in der Form von Kaustäbe aus Birkenholzextrakten
en: Breath fresheners in the form of chew sticks made from birchwood extracts

source: Potpourribeutel zur Verwendung in Aromatherapiekissen
en: Potpourri sachets for incorporating in aromatherapy pillows

source: Kosmetische Präparate zur Bruststraffung
en: Cosmetic breast firming preparations

source: Eau de Toilette mit Schlangenöl
en: Toilet water containing snake oil

source: Flexible Schleifmittel
en: Flexible abrasives

source: Gesichtspuder in Form von puderbeschichtetem Papier
en: Face powder in the form of powder-coated paper

source: Make-Up-Unterlage in der Form von Pasten
en: Make-up bases in the form of pastes

source: Augenbrauenfarben in der Form von Stiften und Puder
en: Eyebrow colors in the form of pencils and powders

source: Antistatikspray für Bekleidung
en: Antistatic sprays for clothing
